<!-- eslint-disable vue/multi-word-component-names -->
<script setup>
import { ref } from 'vue'

const guarantees = ref([
  {
    text: 'Безопасные сделки – деньги резервируются на платформе и переводятся исполнителю только после успешного выполнения заказа.',
  },
  {
    text: 'Рейтинг и отзывы – изучайте рейтинги и отзывы, чтобы выбирать надежных исполнителей и заказчиков.',
  },
  { text: 'Модерация – мы проверяем пользователей и блокируем мошенников.' },
  {
    text: 'Конфиденциальность – все личные данные защищены, а переписка ведется внутри платформы.',
  },
  {
    text: 'Разрешение споров – в случае конфликта наша служба поддержки поможет найти решение.',
  },
])
</script>

<template>
  <div class="relative flex items-center w-3/5 m-auto py-5 gap-4 max-xl:w-4/5 max-lg:w-5/5 max-lg:px-4">
    <div class="flex flex-col gap-4">
      <h2 class="text-[#656565]">Гарантии и безопасность</h2>
      <div class="flex flex-col gap-2 pl-4">
        <ul class="flex gap-1" v-for="guarantee in guarantees" :key="guarantee.id">
          <li class="list-disc">{{ guarantee.text }}</li>
        </ul>
      </div>
      <div>
        <h2 class="text-[#656565] mb-4">Часто задаваемые вопросы</h2>
        <div class="space-y-3">
          <div>
            <p class="text-xl font-semibold">Как работает резервирование денег?</p>
            <p class="mt-1">
              После оформления заказа сумма блокируется на специальном счёте и списывается только
              после подтверждения выполнения заказа.
            </p>
          </div>
          <div>
            <p class="text-xl font-semibold">Что делать, если возник конфликт?</p>
            <p class="mt-1">
              В случае возникновения спора обращайтесь в службу поддержки – мы оперативно разберём
              ситуацию и найдем оптимальное решение.
            </p>
          </div>
        </div>
      </div>
      <p class="font-semibold">
        Наша платформа постоянно совершенствуется, и мы внимательно следим за отзывами пользователей, чтобы улучшить систему гарантий и безопасность. Это позволяет нам оперативно реагировать на любые изменения и обеспечивать максимально комфортное и безопасное взаимодействие для всех участников.
      </p>
    </div>
  </div>
</template>

<style scoped></style>
